{
    "site.title": "HAM",
    "site.made-by-htype": "Made by htype",
    "menu.new-solution": "New solution",
    "menu.about-method": "About method",
    "menu.load-solution": "Load solution",
    "menu.theme-dark": "Dark theme",
    "menu.theme-light": "Light theme",
    "menu.close": "Close",
    "menu.title": "Menu",
    "comparisons.absolutely-inferior": "is absolutely inferior to",
    "comparisons.clearly-less-preferable": "is clearly less preferable to",
    "comparisons.much-less-preferable": "is much less preferable to",
    "comparisons.slightly-less-preferable": "is slightly less preferable to",
    "comparisons.same-degree": "has the same degree of preference as",
    "comparisons.slightly-preferable": "is slightly preferable to",
    "comparisons.much-preferable": "is much preferable to",
    "comparisons.clearly-preferable": "is clearly preferable to",
    "comparisons.absolutely-superior": "is absolutely superior to",
    "comparisons.description.1": "Objects are equally preferable",
    "comparisons.description.2": "One object is slightly preferable to another",
    "comparisons.description.3": "One object is much preferable to another",
    "comparisons.description.4": "One object is clearly preferable to another",
    "comparisons.description.5": "One object is absolutely superior to the other",
    "home.header": "Analytic Hierarchy Process",
    "home.method-description.main-text": "The method is used to find among a set of objects the most acceptable by certain parameters.",
    "home.method-description.read-more": "Learn more about the method",
    "home.question.label": "Enter your question. For example: \"Which Italian supercar is better?\"",
    "home.question.placeholder": "Question",
    "home.question.error": "The \"Question\" field can't be empty",
    "home.description.label": "Enter a description of the solution. For example: \"The solution of one authoritative carjournalist\"",
    "home.description.placeholder": "Description of the solution",
    "home.description.error": "The \"Description\" field can't be empty",
    "home.objects.names.label": "Enter the names of the objects to be compared.",
    "home.objects.names.placeholder": "Name of the object",
    "home.objects.names.add-button": "Add object",
    "home.objects.names.error": "The \"Name of the object\" field can't be empty",
    "home.parameters.names.label": "Enter the names of the parameters by which you want to compare the objects.",
    "home.parameters.names.placeholder": "Name of the parameter",
    "home.parameters.names.add-button": "Add parameter",
    "home.parameters.names.error": "The \"Name of the parameter\" field can't be empty",
    "home.objects.comparisons.label": "Comparison of objects by parameter",
    "home.parameters.comparisons.label": "Comparison of parameters",
    "home.list-of-comparisons.title": "List of comparisons",
    "home.comparison-matrix.title": "Matrix of comparisons",
    "home.result-priority-table.label": "Priority table",
    "home.result-priority-table.objects-title": "Object",
    "home.result-priority-table.priorities-title": "Priority",
    "home.consistency-ratio-table.label": "Consistency ratio table",
    "home.consistency-ratio-table.matrix-label": "Matrix",
    "home.consistency-ratio-table.value-label": "Value",
    "home.consistency-ratio-table.parameters-label": "parameters",
    "home.consistency-ratio-table.objects-label": "objects by parameter",
    "home.solution-saved-label": "Solution is saved",
    "home.save-button": "Save solution",
    "about.title": "About method",
    "about.definition.title": "Definition",
    "about.definition.history": "The analytic hierarchy process (AHP) is a mathematical tool for decision making. Developed by the American mathematician Thomas L. Saati in the 1970s.",
    "about.definition.main": "The method involves representing a complex problem as a hierarchy of goals, criteria, and alternatives. The solution of the problem is through a pairwise comparison procedure at each level of the hierarchy.",
    "about.applications.title": "Applications",
    "about.applications.problems": "The analytic hierarchy process is used to solve a wide range of problems. Initially, the method was developed to solve the problem of planning under unforeseen circumstances. Then the method was used to solve such problems as: energy distribution, investment in conditions of uncertainty, the fight against terrorism and many others.",
    "about.applications.advantages-title": "The analytic hierarchy process has the following advantages:",
    "about.applications.advantages-universality": "universality",
    "about.applications.advantages-psychological-aspects": "taking into account the psychological aspects of decision making;",
    "about.applications.advantages-consistency": "there is formalized method that allows the consistency of both the obtained solution and the intermediate results obtained in a pairwise comparison.",
    "about.applications.advantages-drawbacks": "The main drawback of the method is the need to obtain a large number of estimates from the expert. So, if you need to compare 7 objects based on 7 criteria, you will have to make 168 pairwise comparisons, which is quite a lot.",
    "about.description.title": "Description",
    "about.description.sequence-of-actions": "The sequence of actions necessary to implement the method:",
    "about.description.problem-as-hierarchical-structure-title": "Representation of the problem in the form of a hierarchical structure.",
    "about.description.problem-as-hierarchical-structure-main": "Usually three-level hierarchies are used to solve the problem. At the highest level of the hierarchy is the goal - the question to be answered. At the next level of the hierarchy are the criteria by which objects (alternatives) will be evaluated, the choice of one of which is needed to achieve the goal. At the last level of the hierarchy are the objects to be compared.",
    "about.description.procedure-of-pairwise-comparisons-title": "Performing the procedure of pairwise comparisons.",
    "about.description.procedure-of-pairwise-comparisons-hierarchy": "At each level of the hierarchy, it is necessary to perform a pairwise comparison of all elements of a given level with respect to an element of a higher level. So the criteria are compared with each other in relation to the goal, the alternatives - in relation to each criterion.",
    "about.description.procedure-of-pairwise-comparisons-saati-scale": "Pairwise comparison is performed as follows. Of all the objects at this hierarchy level, two objects are selected and compared with each other using a special \"Saati scale\". This scale has 9 divisions, each of which reflects the degree of preference of one object to another. The table below provides an explanation for each division of the \"Saati scale\".",
    "about.description.procedure-of-pairwise-comparisons-result": "The results of pairwise comparisons of all objects are written in the form of a matrix. An example of such a matrix, containing the results of comparisons of three objects, can be seen in the table below.",
    "about.description.procedure-of-pairwise-comparisons-matrix": "Each cell of this matrix contains a value from the \"Saati scale\", which shows how much the object corresponding to the row of the matrix is preferable to the object corresponding to the matrix column.",
    "about.description.procedure-of-pairwise-comparisons-inverse-values": "Inverse values, such as: \"1/5\", \"1/9\" - indicate that the degree of preference should be read in the opposite direction. Thus, the value \"1/5\" in the matrix means that the degree of preference for the object corresponding to the column, to the object corresponding to the row, is equal to 5.",
    "about.description.procedure-of-pairwise-comparisons-conclusions": "Using the \"Saaty scale\" and the matrix of pairwise comparisons presented above, one can find out that:",
    "about.description.procedure-of-pairwise-comparisons-conclusion-1": "\"Object 1\" is slightly preferable to \"Object 2\";",
    "about.description.procedure-of-pairwise-comparisons-conclusion-2": "\"Object 1\" is absolutely superior to \"Object 3\";",
    "about.description.procedure-of-pairwise-comparisons-conclusion-3": "\"Object 3\" is much preferable to \"Object 2\".",
    "about.description.vectors-of-priorities-title": "The next step is to calculate the vectors of priorities and the consistency of the solution. After filling the matrix of pairwise comparisons, it is necessary to calculate the vector of priorities for the given matrix, in mathematical terms - the main eigenvector, which after normalization becomes a vector of priorities. You can also calculate the consistency of the comparison matrix, which shows how consistent the comparisons are.",
    "about.description.vectors-of-priorities-main": "These comparisons and calculations set the priorities of the elements of given hierarchy level relative to one element of the next level. If there are more than two levels, different priority vectors can be combined into priority matrices, from which one final priority vector for the lower level is determined.",
    "about.description.vectors-of-priorities-calculating": "All these calculations are performed automatically by this web application. However, if you are interested in the process of calculating the priority vector and consistency, their detailed description is given in",
    "about.description.saati-scale-title": "Saati scale",
    "about.description.saati-scale-value": "Value",
    "about.description.saati-scale-description": "Description",
    "about.example.title": "Example",
    "about.example.preface": "An interactive example below shows how to use the analytic hierarchy process and this web application.",
    "about.example.story": "Suppose an amateur car magazine \"First Gear\" decided to conduct its own research and decided to use the AHP and this web application in order to choose the best Italian mid-engine supercar worth less than 10.000 pounds.",
    "about.example.goal": "First of all, it is necessary to determine the goal:",
    "about.example.description": "Details of the task should be placed in the description:",
    "about.example.criteria": "Next, you need to list all the compared objects. It is also necessary to list all the criteria by which these objects are evaluated:",
    "about.example.object-comparisons": "After all the criteria are listed, you can proceed to compare them. For pairwise object comparisons, one of two views can be used: \"List of comparisons\" or \"Comparison matrix\".",
    "about.example.comparison-control": "\"List of comparisons\" is intended for those who are not yet very well versed in the analytic hierarchy process. In this view, each comparison is represented by a slider, changing the position of which, you can set the desired degree of preference for the left object to the right.",
    "about.example.comparison-matrix": "\"Comparison matrix\" is intended for experts. And allows you to directly change the state of the matrix of pairwise comparisons. Each cell of the matrix, except for the cells of the main diagonal, can be edited. The cell can take values from the \"Saati scale\" and their reciprocals. After changing the value of the cell, the value of the \"symmetric\" cell of the matrix also changes.",
    "about.example.pairwise-comparisons": "Next, you need to perform pairwise comparisons of the objects for each of the criteria. Comparisons of the objects are made in a manner similar to the comparison of parameters.",
    "about.example.comparison-of-objects-title": "Comparison of objects by parameter",
    "about.example.comparison-of-objects-label": "Compare objects by parameter",
    "about.example.comparison-of-objects-matrix": "The table below contains a list of objects and their respective priorities. Also, the object with the highest priority is displayed separately.",
    "about.example.highest-priority": "Objects with the highest priority: Ferrari 308 GT4",
    "about.example.consistency-ratio": "The table below contains a list of matrices and their corresponding consistency ratios. The consistency ratio shows how the comparisons in the matrix are consistent. If the consistency ratio of matrix is less than 0.1, the comparisons in this matrix are considered to be sufficiently consistent. Otherwise, comparisons in this matrix are considered to be inconsistent, and it is better to make them again.",
    "about.example.inconsistency-example": "Inconsistency arises, for example, with the following set of comparisons:",
    "about.example.inconsistency-example-description.1": "A is preferable to B;",
    "about.example.inconsistency-example-description.2": "B is preferable to C;",
    "about.example.inconsistency-example-description.3": "C is preferable to A.",
    "about.example.incorrect-result": "It can be seen that the comparisons in the example above are illogical and contradict each other. If there are similar comparisons in the solution, the analytic hierarchy process produces an incorrect result.",
    "about.example.solution-can-be-used": "When all data is filled, the result is calculated and all matrices have acceptable consistency, the solution can be used.",
    "about.example.conclusion": "This completes the training example. Good luck with your decision-making!",
    "about.bibliography.title": "Bibliography",
    "about.bibliography.literature-was-used": "When creating the site, the following literature was used:",
    "about.bibliography.literature-1": "Саати Т. Л. Принятие решений. Метод анализа иерархий. — М.: Радио и связь, 1989. — 316 с.",
    "about.bibliography.literature-2": "Саати Т. Л. Об измерении неосязаемого. Подход к относительным измерениям на основе  главного собственного вектора матрицы парных сравнений  // Журнал \"Cloud Of Science\". 2015. Т. 2. № 1"
}
